jax-ws-amazon/src/test/resources/aws-request.xml

<?xml version="1.0" encoding="UTF-8"?>
<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/">
	<S:Body>
		<ItemSearch
			xmlns="http://webservices.amazon.com/AWSECommerceService/2011-08-01">
			<AWSAccessKeyId>AKIAJLGCOB6CWDELK4FA</AWSAccessKeyId>
			<Request>
				<Keywords>java webservices</Keywords>
				<SearchIndex>Books</SearchIndex>
			</Request>
		</ItemSearch>
	</S:Body>
</S:Envelope>